In [ ]:
# Analise e insights

--------

Novamente, é preciso se importar as dependências e reconectar com o banco, como foi feito nas partes 1 e 2 do trabalho:

In [ ]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

In [3]:
senha = input("Digite sua senha do usuário postgres: ")

# string de conexão com o banco de dados ecommerce
engine = create_engine(f'postgresql://postgres:{senha}@localhost:5432/ecommerce')

--------

Este notebook se dedica ao objetivo principal do trabalho: a análise exploratória de dados e obtenção de insights.

Cada pergunta será analisada uma a uma, usando os resultados das views criadas na última seção para obtenção de gráficos e tabelas que vão responder as perguntas criadas.

### 1. Qual a média de vendas por estilo?

As primeiras 3 perguntas tentam explicar algum padrão na coluna de estilos, que parece ser um código com alguns dígitos do alfabeto e outros dígitos numéricos.

Primeiro, vejamos a média de vendas por estilo:

In [25]:
media_vendas_por_estilo = pd.read_sql(
    '''
    SELECT * FROM media_vendas_por_estilo;
    ''',  
    engine
);

media_vendas_por_estilo

   total_estilos  total_vendas  media
0           1377        128975     93

Pode-se observar que há aproximadamente 93 vendas para cada estilo em média. Isso a principio parece um valor alto, mas quando observamos a quantidade total de estilos na tabela de vendas, vemos que esse valor não é tão alto assim:

In [24]:
qtd_estilos = pd.read_sql(
    '''
    SELECT COUNT(DISTINCT style) AS qtd_estilos FROM vendas;
    ''',  
    engine
);

qtd_estilos

   qtd_estilos
0         1377

É dificil compreender por que há tantos estilos em tão poucos produtos. O próprio nome "estilo" não diz muito sobre o código. 

Tentemos obter mais insights com as próximas perguntas.

### 2. Quais os 3 estilos mais comuns para cada produto?

O objetivo é buscar se um estilo se destaca mais entre os produtos. 

Projetando o top 3 estilos com mais ocorrências para cada produto.

In [ ]:
top_3_estilos_por_produto = pd.read_sql(
    '''
    SELECT * FROM top_3_estilos_por_produto;
    ''',  
    engine
);

top_3_estilos_por_produto.head(30)

Certo, mas esse resultado não diz muita coisa. Vamos tentar projetar os que aparecem mais vezes no top 3:

In [14]:
frequencia_estilo = top_3_estilos_por_produto['style'].str.split(expand=True).stack().value_counts()

resultado = pd.DataFrame({'style': frequencia_estilo.index, 'frequencia': frequencia_estilo.values})

resultado['ranking'] = resultado['frequencia'].rank(ascending=False).astype(int)

print(resultado.head(10))

     style  frequencia  ranking
0  JNE3797          29        1
1  JNE3405          27        2
2    J0230          15        3
3   SET268          10        4
4    J0003           4        5
5    J0341           2        6

Finalmente podemos observar um resultado interessante: os estilos iniciados em JNE tem muito mais ocorrências que os demais.

### 3. Quais os estilos mais comuns no geral e sua quantidade?

Com o resultado anterior em mãos, podemos comparar com o total de ocorrências e verificar se estes valores correspondem:

In [17]:
top_estilos_geral = pd.read_sql(
    '''
    SELECT * FROM top_estilos_geral;
    ''',  
    engine
);

top_estilos_geral.head()

   ranking    style  total
0        1  JNE3797   4224
1        1  JNE3405   2263
2        1    J0230   1868
3        1   SET268   1860
4        1    J0341   1630

O ranking é exatamente igual ao anterior. Com isso, podemos observar que o produto não necessariamente tem alguma relação com o estilo. A semântca do estilo ainda fica em aberto.

### 4. Qual o intervalo temporal entre a primeira e a última venda?

Vamos entender qual o intervalo da amostra:

In [18]:
intervalo_temporal_vendas = pd.read_sql(
    '''
    SELECT * FROM intervalo_temporal_vendas;
    ''',  
    engine
);

intervalo_temporal_vendas.head()

          min         max
0  2022-03-31  2022-06-29

Nota-se que a amostra é pequena, contemplada entre o fechamento do mês de março de 2022 e o final do mês de junho do mesmo ano. Isso impossibilita que analisemos a sazonalidade das vendas ao longo do ano, por exemplo.

### 5. Qual é a quantidade total de vendas por país de entrega?

Vamos observar qual o país que mais recebe pedidos

In [23]:
total_vendida_por_pais = pd.read_sql(
    '''
    SELECT * FROM total_vendida_por_pais;
    ''',  
    engine
);

total_vendida_por_pais

  ship_country  total_vendas_por_pais
0           BR                  14384
1           US                  14327
2           DK                  14325
3           AU                  14325
4           FR                  14325
5           UK                  14323
6           PT                  14323
7           GE                  14322
8           JP                  14321

Analisando a tabela de forma empírica, notamos que não há uma diferença notável entre a quantidade de vendas que cada país recebe, com uma diferença de apenas 63 vendas entre o primeiro e o último (menos de 1%)

### 6. Qual produto é mais vendido em cada país?

Procura-se entender se os produtos mais caros são mais vendidos em países desenvolvidos

In [26]:
produto_mais_vendido_por_pais = pd.read_sql(
    '''
    SELECT * FROM produto_mais_vendido_por_pais;
    ''',  
    engine
);

produto_mais_vendido_por_pais

,ship_country,product,price,total_sales
0,BR,Nintendo Switch Console Lite,329.95,1798
1,FR,PHILIPS Sonicare 9900 Prestige Power Toothbrush,329.00,1737
2,US,PHILIPS Sonicare 9900 Prestige Power Toothbrush,329.00,1807
3,PT,LG 29WL50S - 29 inch UltraWide UHD,279.00,1775
4,DK,LG 29WL50S - 29 inch UltraWide UHD,279.00,1750
5,JP,Kindle Paperwhite (8GB),239.00,1826
6,AU,YABER WiFi Projector Mini Portable Projector 6...,218.00,1822
7,UK,TP-Link Tapo Pan/Tilt Smart Security Camera,66.43,1756
8,GE,Logitech MK270R Wireless Keyboard and Mouse Combo,38.00,1833

Nota-se que o Brasil é o país com o produto mais caro como importação principal. Isso demonstra que o produto mais vendido ser mais caro não depende do desenvolvimento do país.

### 7. Qual a quantidade média de itens por pedido para cada produto?

Para descobrir se existem produtos que são pedidos em mais quantidade em cada pedido

As 10 primeiras linhas serão exibidas ao executar a célula abaixo

In [28]:
media_items_por_pedido = pd.read_sql(
    '''
    SELECT * FROM media_items_por_pedido;
    ''',  
    engine
);

media_items_por_pedido.head(10)

                                             product  media_por_pedido
0                              Apple Lightning Cable          3.036069
1  Logitech MK270R Wireless Keyboard and Mouse Combo          3.023173
2                       Nintendo Switch Console Lite          3.022187
3  Digital Blood Pressure Monitor with Large Colo...          3.020334
4  Fingertip Pulse Oximeter, Blood Oxygen Saturation          3.020092
5               Taco Cat Goat Cheese Pizza Card Game          3.019806
6                              Apple MagSafe Charger          3.014282
7    Apple Lightning to 3.5mm Headphone Jack Adapter          3.013556
8                           Charmast Mini Power Bank          3.012200
9    LEGO Ideas Home Alone McCallisters’ House 21330          3.007746

Como a média é muito parecida, temos um empate técnico. Não há diferença obvia entre a quantidade pedida por venda para cada produto. O produto mais caro tem a mesma média do produto mais barato em quantidade de itens por pedido.

### 8. Existe uma sazonalidade nas vendas ao longo do ano? (Quais são os meses com mais vendas?)

Aqui, o objetivo é verificar se há meses com mais vendas que outros, e entender se a época do ano interfere nos números.

Após executar a query acima, será possível exibir chamar a view abaixo:

In [ ]:
sazonalidade_vendas = pd.read_sql(
    '''
    SELECT * FROM sazonalidade_vendas;
    ''',  
    engine
);

sazonalidade_vendas.head()

### 9. Quais são os produtos mais lucrativos em termos de receita?

Essa consulta busca o carro-chefe das vendas.

Consulte uma parte do resultado executando a célula abaixo

In [ ]:
produtos_mais_lucrativos = pd.read_sql(
    '''
    SELECT * FROM produtos_mais_lucrativos;
    ''',  
    engine
);

produtos_mais_lucrativos.head()

### 10. Quais são os 5 produtos mais vendidos

Essa pergunta acabou sendo respondida durante a criação da view anterior, mas teve um resultado interessante: **todos os produtos tem a mesma quantidade de itens vendidos**

Consulte o resultado executando a célula abaixo

In [ ]:
produtos_mais_vendidos = pd.read_sql(
    '''
    SELECT * FROM produtos_mais_vendidos;
    ''',  
    engine
);

produtos_mais_vendidos.head()

### 11. **(ChatGPT)** Como a quantidade de pedidos varia em relação ao dia da semana? 

Veja o resultado da view abaixo

In [1]:
total_pedidos_por_dia_da_semana = pd.read_sql(
    '''
    SELECT * FROM total_pedidos_por_dia_da_semana;
    ''',  
    engine
);

total_pedidos_por_dia_da_semana.head()

NameError: name 'pd' is not defined

### 12. **(ChatGPT)** Qual é a quantidade média de produtos por país de entrega?

In [29]:
media_vendida_por_pais = pd.read_sql(
    '''
    SELECT * FROM media_vendida_por_pais;
    ''',  
    engine
);

media_vendida_por_pais

  ship_country  media_vendida_por_pais
0           JP                3.008938
1           UK                3.007052
2           AU                3.003700
3           DK                3.001326
4           PT                2.999721
5           FR                2.997347
6           US                2.996929
7           BR                2.995829
8           GE                2.985198

### 13. **(ChatGPT)** Existe uma correlação entre a quantidade de produtos e o serviço de envio escolhido?

In [31]:
relacao_qtd_produtos_e_servico_envio = pd.read_sql(
    '''
    SELECT * FROM relacao_qtd_produtos_e_servico_envio;
    ''',  
    engine
);

relacao_qtd_produtos_e_servico_envio

  ship_service_level  media_vendida_por_servico
0          Expedited                   2.999616
1           Standard                   2.999430

### 14. **(ChatGPT)** Existe uma diferença significativa na quantidade de produtos vendidos entre diferentes países de entrega?

In [32]:
diferenca_produtos_por_pais = pd.read_sql(
    '''
    SELECT * FROM diferenca_produtos_por_pais;
    ''',  
    engine
);

diferenca_produtos_por_pais

  ship_country  total_produtos_por_pais
0           BR                    43092
1           JP                    43091
2           UK                    43070
3           AU                    43028
4           DK                    42994
5           PT                    42965
6           US                    42937
7           FR                    42937
8           GE                    42754

### 15. **(ChatGPT)** Quais são os estilos de produto mais populares?

In [36]:
estilos_mais_populares = pd.read_sql(
    '''
    SELECT * FROM estilos_mais_populares;
    ''',  
    engine
);

estilos_mais_populares.head(10)

     style  total_ocorrencias
0  JNE3797               4224
1  JNE3405               2263
2    J0230               1868
3   SET268               1860
4    J0341               1630
5    J0003               1627
6   SET324               1284
7   SET345               1250
8  JNE3373               1173
9  JNE3440               1054